# Используй образ Golang для сборки приложения
FROM golang:latest

# Устанавливай переменные окружения
ENV GO111MODULE=on
ENV CGO_ENABLED=0

# Создай и установи рабочую директорию внутри контейнера
WORKDIR /app

# Скопируй go.mod и go.sum, чтобы эффективно кэшировать зависимости
COPY go.mod .
COPY go.sum .

# Загрузи зависимости
RUN go mod download

# Скопируй все остальные файлы проекта внутрь контейнера
COPY . .

# Собери приложение
RUN go build -o main .

# Экспортируй порт, на котором будет работать приложение
EXPOSE 50051

# Запусти приложение при старте контейнера
CMD ["./main"]
